#include <linux/module.h>
#include <linux/version.h>
#include <linux/kernel.h>
#include <linux/types.h>
#include <linux/init.h>
#include <linux/delay.h>
#include <linux/sched.h>
#include <linux/interrupt.h>
#include <linux/if_ether.h>
#include <linux/tcp.h>
#include <linux/phy.h>
#include <linux/of_mdio.h>
#include <linux/platform_device.h>
#include <linux/of_device.h>
#include <linux/of_net.h>

#include "raether.h"
#include "ra_mac.h"
#include "ra_eth.h"
#include "ra_phy.h"
#include "ra_ioctl.h"
#include "mii_mgr.h"
#if defined (CONFIG_RAETH_ESW_CONTROL)
#include "mtk_esw/ioctl.h"
#endif
#if defined (CONFIG_RAETH_ESW) || defined (CONFIG_MT7530_GSW)
#include "ra_esw_base.h"
#endif
#if defined (CONFIG_ETHTOOL)
#include "ra_ethtool.h"
#endif
#if defined (CONFIG_RALINK_MT7621)
#include "ra_eth_mt7621.h"
#endif

#if defined (CONFIG_RAETH_CHECKSUM_OFFLOAD) && !defined (RAETH_SDMA)
static int hw_offload_csg = 1;
#if defined (CONFIG_RAETH_SG_DMA_TX)
static int hw_offload_gso = 1;
#if defined (CONFIG_RAETH_TSO)
static int hw_offload_tso = 1;
#endif
#endif
#endif

#if defined (CONFIG_RA_HW_NAT) || defined (CONFIG_RA_HW_NAT_MODULE)

typedef struct {
	uint16_t MAGIC_TAG;
	uint32_t FOE_Entry:14;
#if defined (CONFIG_RALINK_MT7620)
	uint32_t CRSN:5;
	uint32_t SPORT:3;
	uint32_t ALG:10;
#elif defined (CONFIG_RALINK_MT7621)
	uint32_t CRSN:5;
	uint32_t SPORT:4;
	uint32_t ALG:9;
#else
	uint32_t FVLD:1;
	uint32_t ALG:1;
	uint32_t AI:8;
	uint32_t SP:3;
	uint32_t AIS:1;
	uint32_t RESV2:4;
#endif
}  __attribute__ ((packed)) PdmaRxDescInfo4;

#define FOE_MAGIC_GE		    0x7275
#define FOE_MAGIC_PPE_DWORD	    0x3fff7276UL	/* HNAT_V1: FVLD=0, HNAT_V2: FOE_Entry=0x3fff */
#define FOE_INFO_START_ADDR(skb)    (skb->head)
#define FOE_MAGIC_TAG(skb)	    ((PdmaRxDescInfo4 *)((skb)->head))->MAGIC_TAG
#define DO_FILL_FOE_DESC(skb,desc)  (*(uint32_t *)(FOE_INFO_START_ADDR(skb)+2) = (uint32_t)(desc))
#define IS_DPORT_PPE_VALID(skb)	    (*(uint32_t *)(FOE_INFO_START_ADDR(skb)) == FOE_MAGIC_PPE_DWORD)

#define FOE_4TB_SIZ		16384

enum DstPort {
	DP_RA0 = 11,
	DP_RA1 = 12,
	DP_RA2 = 13,
	DP_RA3 = 14,
	DP_RA4 = 15,
	DP_RA5 = 16,
	DP_RA6 = 17,
	DP_RA7 = 18,
	DP_RA8 = 19,
	DP_RA9 = 20,
	DP_RA10 = 21,
	DP_RA11 = 22,
	DP_RA12 = 23,
	DP_RA13 = 24,
	DP_RA14 = 25,
	DP_RA15 = 26,
	DP_WDS0 = 27,
	DP_WDS1 = 28,
	DP_WDS2 = 29,
	DP_WDS3 = 30,
	DP_APCLI0 = 31,
	DP_MESH0 = 32,
	DP_RAI0 = 33,
	DP_RAI1 = 34,
	DP_RAI2 = 35,
	DP_RAI3 = 36,
	DP_RAI4 = 37,
	DP_RAI5 = 38,
	DP_RAI6 = 39,
	DP_RAI7 = 40,
	DP_RAI8 = 41,
	DP_RAI9 = 42,
	DP_RAI10 = 43,
	DP_RAI11 = 44,
	DP_RAI12 = 45,
	DP_RAI13 = 46,
	DP_RAI14 = 47,
	DP_RAI15 = 48,
	DP_WDSI0 = 49,
	DP_WDSI1 = 50,
	DP_WDSI2 = 51,
	DP_WDSI3 = 52,
	DP_APCLII0 = 53,
	DP_MESHI0 = 54,
	MAX_WIFI_IF_NUM = 55,
	DP_GMAC1 = 60,
	DP_GMAC2 = 61,
	DP_NIC0 = 62,
	DP_NIC1 = 63,
	MAX_IF_NUM // MAX_IF_NUM = 64 entries (act_dp length 6bits)
};

/* state = unbind & dynamic */
struct ud_info_blk1 {
	uint32_t time_stamp:8;
	uint32_t pcnt:16;	/* packet count */
	uint32_t preb:1;
	uint32_t pkt_type:3;
	uint32_t state:2;
	uint32_t udp:1;
	uint32_t sta:1;		/* static entry */
};

/* state = bind & fin */
struct bf_info_blk1 {
	uint32_t time_stamp:15;
	uint32_t ka:1;		/* keep alive */
	uint32_t vlan_layer:3;
	uint32_t psn:1;		/* egress packet has PPPoE session */
#if defined (CONFIG_RALINK_MT7621)
	uint32_t vpm:2;		/* 0:ethertype remark, 1:0x8100, 2:0x88a8 */
#else
	uint32_t dvp:1;		/* inform switch of keeping VPRI */
	uint32_t drm:1;		/* inform switch of keeping DSCP(IPv4) or TC(IPv6) */
#endif
	uint32_t cah:1;		/* cacheable flag */
	uint32_t rmt:1;		/* remove tunnel ip header (6rd/dslite only) */
	uint32_t ttl:1;
	uint32_t pkt_type:3;
	uint32_t state:2;
	uint32_t udp:1;
	uint32_t sta:1;		/* static entry */
};

struct _info_blk2 {
#if defined (CONFIG_RALINK_MT7621)
	uint32_t qid:4;		/* QID in Qos Port */
	uint32_t fqos:1;	/* force to PSE QoS port */
	uint32_t dp:3;		/* force to PSE port x 0:PSE, 1:GSW, 2:GMAC, 4:PPE, 5:QDMA, 7:DROP */
	uint32_t mcast:1;	/* multicast this packet to CPU */
	uint32_t pcpl:1;	/* OSBN */
	uint32_t mlen:1;	/* 0:post 1:pre packet length in meter */
	uint32_t alen:1;	/* 0:post 1:pre packet length in accounting */
	uint32_t port_mg:6;	/* port meter group */
	uint32_t port_ag:6;	/* port account group */
	uint32_t dscp:8;	/* DSCP value */
#else
	uint32_t fpidx:4;	/* force port index */
	uint32_t fp:1;		/* force new user priority */
	uint32_t up:3;		/* new user priority */
	uint32_t fdq:4;		/* force DRAM queue (for CAR case) */
	uint32_t port_mg:6;	/* port meter group */
	uint32_t port_ag:6;	/* port account group */
	uint32_t dscp:8;	/* DSCP value */
#endif
};

/*
 * Foe Entry (80B: IPv6, 64B: IPv4)
 *
 *      IPV4 HNAPT:                  IPV4:
 *	+-----------------------+    +-----------------------+
 *	|  Information Block 1  |    |  Information Block 1  |
 *	+-----------------------+    +-----------------------+
 *	|         SIP(4B)       |    |        SIP(4B)        |
 *	+-----------------------+    +-----------------------+
 *	|         DIP(4B)       |    |        DIP(4B)        |
 *	+-----------+-----------+    +-----------------------+
 *	| SPORT(2B) | DPORT(2B) |    |         RESV          |
 *	+--------+--+-----------+    +-----------------------+
 *	| EG DSCP| Info Block 2 |    |  Information Block 2  |
 *	+--------+--------------+    +-----------------------+
 *	|      New SIP(4B)      |    |     New SIP (4B)      |
 *	+-----------------------+    +-----------------------+
 *	|      New DIP(4B)      |    |     New DIP (4B)      |
 *	+-----------+-----------+    +-----------+-----------+
 *	| New SPORT | New DPORT |    | New SPORT | New DPORT |
 *	+-----------+-----------+    +-----------+-----------+
 *	|         RESV          |    |         RESV          |
 *	+-----------------------+    +-----------------------+
 *	|         RESV          |    |         RESV          |
 *	+------+----------------+    +------+----------------+
 *	|Act_dp|      RESV      |    |Act_dp|      RESV      |
 *	+------+----+-----------+    +------+----+-----------+
 *	|   ETYPE   |   VLAN1   |    |   ETYPE   |   VLAN1   |
 *	+-----------+-----------+    +-----------+-----------+
 *	|       DMAC[47:16]     |    |       DMAC[47:16]     |
 *	+-----------+-----------+    +-----------+-----------+
 *	| DMAC[15:0]|   VLAN2   |    | DMAC[15:0]|   VLAN2   |
 *	+-----------+-----------+    +-----------+-----------+
 *	|       SMAC[47:16]     |    |       SMAC[47:16]     |
 *	+-----------+-----------+    +-----------+-----------+
 *	| SMAC[15:0]| PPPOE ID  |    | SMAC[15:0]| PPPOE ID  |
 *	+-----------+-----------+    +-----------+-----------+
 *
 */

struct _ipv4_hnapt {
	union {
		struct ud_info_blk1 udib1;
		struct bf_info_blk1 bfib1;
		uint32_t info_blk1;	// 1
	};

	uint32_t sip;			// 2
	uint32_t dip;			// 3
	uint16_t dport;
	uint16_t sport;			// 4

	union {
		struct _info_blk2 iblk2;
		uint32_t info_blk2;	// 5
	};

	uint32_t new_sip;		// 6
	uint32_t new_dip;		// 7

	uint16_t new_dport;
	uint16_t new_sport;		// 8

	uint32_t resv1;			// 9
	uint32_t resv2;			// 10
	uint32_t resv3:26;
	uint32_t act_dp:6;		// 11 (UDF)
	uint16_t vlan1;
	uint16_t etype;			// 12
	uint8_t dmac_hi[4];		// 13
	uint16_t vlan2;
	uint8_t dmac_lo[2];		// 14
	uint8_t smac_hi[4];		// 15
	uint16_t pppoe_id;
	uint8_t smac_lo[2];		// 16
};

struct _ipv4_dslite {
	union {
		struct ud_info_blk1 udib1;
		struct bf_info_blk1 bfib1;
		uint32_t info_blk1;	// 1
	};

	uint32_t sip;			// 2
	uint32_t dip;			// 3
	uint16_t dport;
	uint16_t sport;			// 4

	uint32_t tunnel_sipv6_0;	// 5
	uint32_t tunnel_sipv6_1;	// 6
	uint32_t tunnel_sipv6_2;	// 7
	uint32_t tunnel_sipv6_3;	// 8

	uint32_t tunnel_dipv6_0;	// 9
	uint32_t tunnel_dipv6_1;	// 10
	uint32_t tunnel_dipv6_2;	// 11
	uint32_t tunnel_dipv6_3;	// 12

	uint8_t flow_lbl[3];		/* in order to consist with Linux kernel (should be 20bits) */
	uint16_t priority:4;		/* in order to consist with Linux kernel (should be 8bits) */
	uint16_t resv:4;		// 13

	uint32_t hop_limit:8;
	uint32_t resv2:18;
	uint32_t act_dp:6;		// 14 (UDF)

	union {
		struct _info_blk2 iblk2;
		uint32_t info_blk2;	// 15
	};

	uint16_t vlan1;
	uint16_t etype;			// 16
	uint8_t dmac_hi[4];		// 17
	uint16_t vlan2;
	uint8_t dmac_lo[2];		// 18
	uint8_t smac_hi[4];		// 19
	uint16_t pppoe_id;
	uint8_t smac_lo[2];		// 20
};

struct _ipv6_3t_route {
	union {
		struct ud_info_blk1 udib1;
		struct bf_info_blk1 bfib1;
		uint32_t info_blk1;	// 1
	};

	uint32_t ipv6_sip0;		// 2
	uint32_t ipv6_sip1;		// 3
	uint32_t ipv6_sip2;		// 4
	uint32_t ipv6_sip3;		// 5

	uint32_t ipv6_dip0;		// 6
	uint32_t ipv6_dip1;		// 7
	uint32_t ipv6_dip2;		// 8
	uint32_t ipv6_dip3;		// 9

	uint32_t prot:8;
	uint32_t resv:24;		// 10

	uint32_t resv1;			// 11
	uint32_t resv2;			// 12
	uint32_t resv3;			// 13

	uint32_t resv4:26;
	uint32_t act_dp:6;		// 14 (UDF)

	union {
		struct _info_blk2 iblk2;
		uint32_t info_blk2;	// 15
	};

	uint16_t vlan1;
	uint16_t etype;			// 16
	uint8_t dmac_hi[4];		// 17
	uint16_t vlan2;
	uint8_t dmac_lo[2];		// 18
	uint8_t smac_hi[4];		// 19
	uint16_t pppoe_id;
	uint8_t smac_lo[2];		// 20
};

struct _ipv6_5t_route {
	union {
		struct ud_info_blk1 udib1;
		struct bf_info_blk1 bfib1;
		uint32_t info_blk1;	// 1
	};

	uint32_t ipv6_sip0;		// 2
	uint32_t ipv6_sip1;		// 3
	uint32_t ipv6_sip2;		// 4
	uint32_t ipv6_sip3;		// 5

	uint32_t ipv6_dip0;		// 6
	uint32_t ipv6_dip1;		// 7
	uint32_t ipv6_dip2;		// 8
	uint32_t ipv6_dip3;		// 9

	uint16_t dport;
	uint16_t sport;			// 10

	uint32_t resv1;			// 11
	uint32_t resv2;			// 12
	uint32_t resv3;			// 13

	uint32_t resv4:26;
	uint32_t act_dp:6;		// 14 (UDF)

	union {
		struct _info_blk2 iblk2;
		uint32_t info_blk2;	// 15
	};

	uint16_t vlan1;
	uint16_t etype;			// 16
	uint8_t dmac_hi[4];		// 17
	uint16_t vlan2;
	uint8_t dmac_lo[2];		// 18
	uint8_t smac_hi[4];		// 19
	uint16_t pppoe_id;
	uint8_t smac_lo[2];		// 20
};

struct _ipv6_6rd {
	union {
		struct ud_info_blk1 udib1;
		struct bf_info_blk1 bfib1;
		uint32_t info_blk1;	// 1
	};

	uint32_t ipv6_sip0;		// 2
	uint32_t ipv6_sip1;		// 3
	uint32_t ipv6_sip2;		// 4
	uint32_t ipv6_sip3;		// 5

	uint32_t ipv6_dip0;		// 6
	uint32_t ipv6_dip1;		// 7
	uint32_t ipv6_dip2;		// 8
	uint32_t ipv6_dip3;		// 9

	uint16_t dport;
	uint16_t sport;			// 10

	uint32_t tunnel_sipv4;		// 11
	uint32_t tunnel_dipv4;		// 12

	uint32_t hdr_chksum:16;
	uint32_t dscp:8;
	uint32_t ttl:8;			// 13

	uint32_t flag:3;
	uint32_t resv1:23;
	uint32_t act_dp:6;		// 14 (UDF)

	union {
		struct _info_blk2 iblk2;
		uint32_t info_blk2;	// 15
	};

	uint16_t vlan1;
	uint16_t etype;			// 16
	uint8_t dmac_hi[4];		// 17
	uint16_t vlan2;
	uint8_t dmac_lo[2];		// 18
	uint8_t smac_hi[4];		// 19
	uint16_t pppoe_id;
	uint8_t smac_lo[2];		// 20
};

struct FoeEntry {
	union {
		struct ud_info_blk1 udib1;
		struct bf_info_blk1 bfib1;	// common header
		struct _ipv4_hnapt ipv4_hnapt;	// nat & napt share same data structure
		struct _ipv4_dslite ipv4_dslite;
		struct _ipv6_3t_route ipv6_3t_route;
		struct _ipv6_5t_route ipv6_5t_route;
		struct _ipv6_6rd ipv6_6rd;
	};
};

struct FoeEntry *PpeFoeBase = NULL;
dma_addr_t PpeFoeBasePhy = 0;
int (*ra_sw_nat_hook_rx)(struct sk_buff *skb) = NULL;
int (*ra_sw_nat_hook_tx)(struct sk_buff *skb, int gmac_no) = NULL;
int (*ra_sw_nat_hook_rs)(struct net_device *dev, int hold) = NULL;
int (*ra_sw_nat_hook_ec)(int engine_init) = NULL;
EXPORT_SYMBOL(ra_sw_nat_hook_rx);
EXPORT_SYMBOL(ra_sw_nat_hook_tx);
EXPORT_SYMBOL(ra_sw_nat_hook_rs);
EXPORT_SYMBOL(ra_sw_nat_hook_ec);
#endif

#if defined (CONFIG_RAETH_READ_MAC_FROM_MTD)
extern int ra_mtd_read_nm(char *name, loff_t from, size_t len, u_char *buf);
#endif

#if defined (CONFIG_VLAN_8021Q_DOUBLE_TAG)
